Revit 2026 API

# NumberingSchemaGetNumbers Method

---

Returns all numbers currently used in the given numbering sequence

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IList<IntegerRange> GetNumbers(
	string partition
)
```
```vb
Public Function GetNumbers (
	partition As String
) As IList(Of IntegerRange)
```
```cpp
public:
IList<IntegerRange^>^ GetNumbers(
	String^ partition
)
```
```fsharp
member GetNumbers :
        partition : string -> IList<IntegerRange>
```

#### Parameters

partition String
     Name of the partition that identifies the sequence. The sequence must exist.

#### Return Value

IListIntegerRange A collection of integer ranges

| Exception | Condition |
| --- | --- |
| ArgumentException | The sequence partition does not exist in the schema. |
| ArgumentNullException | A non-optional argument was null |

Numbers are returned as a collection of ranges, where each range is a pair of two integer values, Low and High. As long as there is no gap currently in the sequence, there will be only one range.

#### Reference

NumberingSchema Class

Autodesk.Revit.DB Namespace